public/about-me.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About me</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">About me</h1>

<div id="outline-container-org2f8e587" class="outline-2">
<h2 id="org2f8e587">About me</h2>
<div class="outline-text-2" id="text-org2f8e587">
<p>
Hello. I go by <code>thefossenjoyer</code> on the Internet.
</p>

<p>
I never tried blogging, so Imma keep this short.
</p>

<p>
Tl;dr, I am a classical guitarist and a programmer.
</p>
</div>
</div>

<div id="outline-container-orgaa664f8" class="outline-2">
<h2 id="orgaa664f8">My software</h2>
<div class="outline-text-2" id="text-orgaa664f8">
</div>
<div id="outline-container-org0238b5f" class="outline-3">
<h3 id="org0238b5f">My OS</h3>
<div class="outline-text-3" id="text-org0238b5f">
<p>
My <b>current</b> daily driver is <code>GuixOS</code>, a GNU/Linux distro based on the <code>guix</code> package manager.
Guix is a functional pkg manager, highly inspired by <a href="https://nixos.org/">Nix</a>.
</p>

<p>
As it shouldn't be suprising, by default there <b>isn't any</b> non-free software in guix's repos.
Talking about non-free software, Guix System uses <code>Linux libre</code> instead of the full Linux kernel. The reason for that is quite obvious. There are some proprietary blobs in the kernel (drivers..).
</p>

<p>
Of course, the community found a way around these limitations. There is a <a href="https://gitlab.com/nonguix/nonguix">repo</a> with non-free software. Also, <a href="https://youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ">System Crafters</a> provides a custom ISO with the full Linux kernel and the repo already set up.
</p>
</div>
</div>

<div id="outline-container-orga25d1e2" class="outline-3">
<h3 id="orga25d1e2">My text editor</h3>
<div class="outline-text-3" id="text-orga25d1e2">
<p>
I daily drive Emacs. I've hopped between Emacs and Neovim few times. I don't think I'll switch back to Neovim anytime soon(sorry my friend :p).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
